# 公众号配置
# 公众号appId
app_id = "wxa3d49e32c007c36b"
# 公众号appSecret
app_secret = "e8bc984521ece23ccb3ba4bfc47d1785"
# 模板消息id
# 每日消息
template_id1 = "6K3fNkhfNwITWtdhFn-nywGBRaUaUDvw0wCPQU27gcE"
# 课程消息,上课提醒
template_id2 = "BvMhsPli3QTYjbDR7MYYNOVgGm8NaIm2svSH14wqgKQ"
# 晚安心语
template_id3 = "7N-YcUScSuXSc9z2bzByC9wmUaxkn4F01u60W68nsX4"
# 接收公众号消息的微信号
# 这是openid
user = ["oXvI66tgOrR0Cuo2u6X7Mc30bHAs"]

# 信息配置
# 所在省份
province = "河南"
# 所在城市
city = "郑州"
# 生日，如果月份或者日期小于10，直接用对应的数字即可，例如2000-1-1，---------倒计时
birthday = "2004-12-27"
# 放假日期，格式同上------------计时器
love_date = "2025-2-10"
# 天行数据晚安心语 key
good_Night_Key = "57702dff3d0abfb2b9b3a5ab3cf60454"
# -------------------------------------------------------------------------
# 设置学期第一周开始日期
year = 2024
month = 8
day = 26
# 每日推送时间
post_Time = "07:15:00"
# 每节课提醒时间（有课才会提醒）, 时:分:秒  的形式, 字符串, 根据个人需要设置几次
time_table = ["07:40:00", "9:40:00", "13:40:00", "15:30:00","18:00:00", "19:40:00"]
# 课程时间
course_Time = ["8:10--9:50", "10:10--11:50", "14:00--15:40", "15:50--17:50","19:00--20:45"]
# 晚安心语及第二天课程推送时间
good_Night_Time = "23:55:00"
# 课程表 "1"代表第一周，依次类推，根据个人实际课表添加，有几周就添加几周,
# 每一行代表一天, 例如  ['', '编译原理', '', '数据库原理及应用', '数据分析原理', '']  代表周一
classes = \
    {
        "2": [
            ['', '操作系统@综合楼407', '自然语言处理@信院B502', '','',''],
            ['多元统计分析@综合楼204', '', '自然语言处理@信院B502', '','',''],
            ['图像模式识别@信院A306', '形式与政策@综合楼107', '', '','',''],
            ['多元统计分析@综合楼402', '单片机原理@综合楼308', '图像模式识别@信院A306', '','',''],
            ['', '', '', '单片机原理@综合楼205','',''],
            ['', '', '', '','',''],
            ['', '', '', '','','']
        ],
        "3": [
            ['', '操作系统@综合楼407', '自然语言处理@信院B502', '','',''],
            ['多元统计分析@综合楼204', '', '自然语言处理@信院B502', '','',''],
            ['图像模式识别@信院A306', '', '', '','',''],
            ['多元统计分析@综合楼402', '单片机原理@综合楼308', '图像模式识别@信院A306', '','',''],
            ['', '操作系统@信院B502', '', '单片机原理@综合楼205','',''],
            ['', '', '', '','',''],
            ['', '', '', '','','']
        ],
        "4": [
            ['', '操作系统@综合楼407', '自然语言处理@信院B502', '','',''],
            ['多元统计分析@综合楼204', '', '自然语言处理@信院B502', '','',''],
            ['图像模式识别@信院A306', '形式与政策@综合楼107', '', '','',''],
            ['多元统计分析@综合楼402', '单片机原理@综合楼308', '图像模式识别@信院A306', '','',''],
            ['', '', '', '单片机原理@综合楼205','',''],
            ['', '', '', '','',''],
            ['', '', '', '','','']
        ],
        "5": [
            ['', '操作系统@综合楼407', '自然语言处理@信院B502', '','',''],
            ['多元统计分析@综合楼204', '', '自然语言处理@信院B502', '','',''],
            ['图像模式识别@信院A306', '', '', '','',''],
            ['多元统计分析@综合楼402', '单片机原理@综合楼308', '图像模式识别@信院A306', '','',''],
            ['', '操作系统@信院B502', '', '单片机原理@综合楼205','',''],
            ['', '', '', '','',''],
            ['', '', '', '','','']
        ],
        "6": [
            ['', '操作系统@综合楼407', '自然语言处理@信院B502', '','',''],
            ['多元统计分析@综合楼204', '', '自然语言处理@信院B502', '','',''],
            ['图像模式识别@信院A306', '形式与政策@综合楼107', '', '','',''],
            ['多元统计分析@综合楼402', '单片机原理@综合楼308', '图像模式识别@信院A306', '','',''],
            ['', '', '', '单片机原理@综合楼205','',''],
            ['', '', '', '','',''],
            ['', '', '', '','','']
        ],
        "7": [
            ['', '操作系统@综合楼407', '自然语言处理@信院B502', '','',''],
            ['多元统计分析@综合楼204', '', '自然语言处理@信院B502', '','',''],
            ['图像模式识别@信院A306', '', '', '','',''],
            ['多元统计分析@综合楼402', '单片机原理@综合楼308', '图像模式识别@信院A306', '','',''],
            ['', '操作系统@信院B502', '', '单片机原理@综合楼205','',''],
            ['', '', '', '','',''],
            ['', '', '', '','','']
        ],
        "8": [
            ['', '操作系统@综合楼407', '自然语言处理@信院B502', '','',''],
            ['多元统计分析@综合楼204', '', '自然语言处理@信院B502', '','',''],
            ['图像模式识别@信院A306', '形式与政策@综合楼107', '', '','',''],
            ['多元统计分析@综合楼402', '单片机原理@综合楼308', '图像模式识别@信院A306', '','',''],
            ['', '', '', '单片机原理@综合楼205','',''],
            ['', '', '', '','',''],
            ['', '', '', '','','']
        ],
        "9": [
            ['', '操作系统@综合楼407', '自然语言处理@信院B502', '','',''],
            ['多元统计分析@综合楼204', '', '自然语言处理@信院B502', '','',''],
            ['图像模式识别@信院A306', '', '', '','',''],
            ['多元统计分析@综合楼402', '单片机原理@综合楼308', '图像模式识别@信院A306', '','',''],
            ['', '操作系统@信院B502', '', '单片机原理@综合楼205','',''],
            ['', '', '', '','',''],
            ['', '', '', '','','']
        ],
        "10": [
            ['', '操作系统@综合楼407', '自然语言处理@信院B502', '','',''],
            ['多元统计分析@综合楼204', '', '自然语言处理@信院B502', '','',''],
            ['图像模式识别@信院A306', '形式与政策@综合楼107', '', '','',''],
            ['多元统计分析@综合楼402', '单片机原理@综合楼308', '图像模式识别@信院A306', '','',''],
            ['', '', '', '单片机原理@综合楼205','',''],
            ['', '', '', '','',''],
            ['', '', '', '','','']
        ],
        "11": [
            ['', '操作系统@综合楼407', '自然语言处理@信院B502', '','',''],
            ['多元统计分析@综合楼204', '', '自然语言处理@信院B502', '','',''],
            ['图像模式识别@信院A306', '', '', '','',''],
            ['多元统计分析@综合楼402', '单片机原理@综合楼308', '图像模式识别@信院A306', '','',''],
            ['', '操作系统@信院B502', '', '单片机原理@综合楼205','',''],
            ['', '', '', '','',''],
            ['', '', '', '','','']
        ],
        "12": [
            ['', '操作系统@综合楼407', '自然语言处理@信院B502', '','',''],
            ['多元统计分析@综合楼204', '', '自然语言处理@信院B502', '','',''],
            ['图像模式识别@信院A306', '形式与政策@综合楼107', '', '','',''],
            ['多元统计分析@综合楼402', '单片机原理@综合楼308', '图像模式识别@信院A306', '','',''],
            ['', '', '', '单片机原理@综合楼205','',''],
            ['', '', '', '','',''],
            ['', '', '', '','','']
        ],
        "13": [
            ['', '操作系统@综合楼407', '自然语言处理@信院B502', '','',''],
            ['多元统计分析@综合楼204', '', '自然语言处理@信院B502', '','',''],
            ['图像模式识别@信院A306', '', '', '','',''],
            ['多元统计分析@综合楼402', '单片机原理@综合楼308', '图像模式识别@信院A306', '','',''],
            ['', '操作系统@信院B502', '', '单片机原理@综合楼205','',''],
            ['', '', '', '','',''],
            ['', '', '', '','','']
        ],

    }

# 模板 1：每日提醒模板
# 本周是开学的第: {{weeks.DATA}} 周
# 今天是: {{date.DATA}}
# 城市： {{city.DATA}}
# 天气： {{weather.DATA}}
# 最低气温: {{min_temperature.DATA}}
# 最高气温: {{max_temperature.DATA}}
# 今天是破壳日的第: {{love_day.DATA}} 天
# 距离开学还有: {{birthday.DATA}} 天
# ----------------今日课程----------------
# 第一讲: {{firstClass.DATA}}
# 第二讲: {{secondClass.DATA}}
# 第三讲: {{thirdClass.DATA}}
# 第四讲: {{fourthClass.DATA}}
# 第五讲: {{fifthClass.DATA}}
# 第六讲: {{sixthClass.DATA}}

# 模板 2 课程单推
# 课程信息: {{classInfo.DATA}}

# 模板 3 晚安心语推送和第二天课程推送
# {{goodNight.DATA}}
# ----------------明日课程----------------
# 明天是: {{week.DATA}}
# 第一讲: {{firstClass.DATA}}
# 第二讲: {{secondClass.DATA}}
# 第三讲: {{thirdClass.DATA}}
# 第四讲: {{fourthClass.DATA}}
# 第五讲: {{fifthClass.DATA}}
# 第六讲: {{sixthClass.DATA}}
